# to use: cd to this file's directory, run `brew bundle`

# Tap Homebrew
tap "anchore/grype"
tap "civo/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


##############################################################################
# optional or environment-specific applications
##############################################################################
# for macOS
cask_args appdir: "/Applications"
cask "caffeine"
cask "rectangle" #window snapping tool
cask "vlc-webplugin"

# for Linux
brew "htop" #interactive process viewer

# for personal use
cask "1clipboard" #clipboard history
cask "adobe-acrobat-reader"
cask "authy" #sync'd 2FA application
cask "bitwarden" #password manager
cask "discord" 
cask "drawio"
cask "firefox"
cask "gimp"
cask "google-drive"
cask "handbrake"
cask "inkscape" #svg tool
cask "libreoffice"
cask "mactex" #latex editor
cask "makemkv"
cask "musicbrainz-picard"
cask "nextcloud"
cask "obs"
cask "plex"
cask "plex-media-player"
cask "pocket-casts" #podcasts manager
cask "slack"
cask "spotify"
cask "surfshark" #vpn
cask "tidal" #hi-res music
cask "transmission" #bittorrent client
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "vnc-server"
cask "vnc-viewer"
cask "wireshark" # Graphical network analyzer and capture tool
brew "speedtest-cli" # run `speedtest-cli -h` for speedtest help
brew "youtube-dl"

# System
cask "gdisk" #disk partitioning tool
brew "bash-completion@2"
brew "binutils" #GNU binary tools 
brew "coreutils" #GNU File, Shell, and Text utilities
brew "curl" #get a file from an HTTP, HTTPS or FTP server
brew "dnstracer" #trace a chain of DNS servers to the source
brew "findutils" #collection of GNU find, xargs, and locate
brew "gawk" #GNU awk
brew "gmp" #GNU multiple precision arithmetic library - https://gmplib.org/
brew "gnutls" #GNU TLS Library
brew "gnu-indent" #C code prettifier
brew "gnu-getopt" #command-line option parsing utility
brew "gnu-sed" #GNU sed (stream editor)
brew "gnu-tar" #GNU tar
brew "grep" #GNU grep, egrep and fgrep
brew "nmap" #port scanning utility for large networks
brew "openssh" # ssh tools - https://www.openssh.com/
brew "pidof" #displays PID for a given process name
brew "pstree" #outputs 'ps' as a tree
brew "rename" #file rename script
brew "rlwrap" #adds readline support to tools that lack it
brew "socat" #extended netcat (utility for managing network connections); required by openshift-cli
brew "tldr" #simplified man pages
brew "tmux" #terminal multiplexer
brew "vim"
brew "wget" #file retriever
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Docker
cask "docker"
brew "docker-compose"
brew "docker-completion"
brew "docker-compose-completion"
brew "docker-machine-completion"

# Ops
cask "asana"
brew "ansible"
brew "awscli"
brew "jsonnet"
brew "jsonnet-bundler"
brew "kind" #run local k8s in docker
brew "nginx" #HTTP(S) server, reverse proxy, IMAP/POP3 proxy
brew "tfenv" #terraform version manager

# Images, Audio, Video
brew "ffmpeg"
brew "gifify" #turns .mov into GIF's - https://github.com/jclem/gifify
brew "imagemagick" #tools and libraries to manipulate images in many formats - https://imagemagick.org/index.php

# Archive & Git
brew "git"
brew "p7zip" #7-zip archiver
brew "xz" #general purpose compression utility; required by multiple brews

# JSON
brew "jo" #JSON shell output
brew "jq" #CLI JSON processor

# Dev
cask "cyberduck" #cloud storage browser
cask "pgadmin4" #PostgreSQL dev+admin platform
cask "postman" #API test utility
cask "squirrelsql" #JDBC-compliant database viewer
cask "visual-studio-code"
brew "ammonite-repl"
brew "asdf"
brew "boost" #portable C++ source libraries
brew "cmake" #cross-platform make utility
brew "go"
brew "kotlin"
brew "node"
brew "openjdk"
brew "postgresql@14"
brew "pyenv" #python version management
brew "python" #python 3
brew "rbenv" #ruby version manager
brew "ruby-build" #installs various ruby versions
brew "rust"
brew "scala"
brew "yarn" #JS package manager

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "openshift-cli"
brew "helm"
brew "minikube"

# GitLab Pages
brew "hugo"
